Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПребывания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСОРПМЖ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Организация,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ответственный,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Комментарий,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет,
	|	СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаРегистрации,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаСнятияСРегистрации,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание КАК ДомРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Квартира КАК КвартираРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК СвидетельствоОРегистрацииПоМестуПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 75, АдресПрибытия_1, АдресПрибытия_2);
	ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
	ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
	
	// ШапкаОбласть.Параметры.НомерСвидетельства = Формат(Число(Номер),"");.
	// БИТ_ЖКХ 05.10.2015 17:41:00 Начало правки... 
	//ШапкаОбласть.Параметры.НомерСвидетельства = Номер;
	// БИТ_ЖКХ 05.10.2015 17:41:01 Конец правки. 
	
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	// БИТ_ЖКХ добавление кода Начало: 02.12.2011 
	СтрокаФИО = ?(ЗначениеЗаполнено(Выборка.Фамилия),Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество), Выборка.РегистрируемоеЛицо);
	// БИТ_ЖКХ изменения кода: 24.04.2012
	// Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда.
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) и  ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
		ШапкаОбласть.Параметры.ФизЛицо = СтрокаФИО + ", "+ Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'");
	Иначе
		ШапкаОбласть.Параметры.ФизЛицо = СтрокаФИО; 
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		ШапкаОбласть.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРег = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));                                                                
		ШапкаОбласть.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
	КонецЕсли; 
	Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
		ШапкаОбласть.Параметры.ЧислоСнят  = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСнят = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
		ШапкаОбласть.Параметры.ГодСнят    = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
	КонецЕсли; 
	// БИТ_ЖКХ добавление кода конец : 02.12.2011
	//
	// ШапкаОбласть.Параметры.ДатаОкончанияРегистрации	 = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");.
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Выборка.ДомРег.ПаспортнаяСлужба;				
		
	КонецЕсли; 
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСОРПМЖ()

// Процедура осуществляет печать документа.
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "СОРПМЖ" тогда
		
		ТабДокумент = ПечатьСОРПМЖ();
		
	КонецЕсли;
	
	Если ИмяМакета = "СОРПМЖ_ДУБЛИКАТ" Тогда
		
		ТабДокумент = ПечатьСОРПМЖДубликат();
		
	КонецЕсли;
	
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт


Возврат Новый Структура("СОРПМЖ","Свидетельство о регистрации по месту пребывания");


КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

//// Процедура - обработчик события "ОбработкаЗаполнения".
////
Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	// БИТ_ЖКХ изменения кода:  31.08.2012
	// Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ЗаявлениеОРегистрацииПоМестуПЖ")Тогда.
	Если ТипЗнч(Основание) <> Тип("Структура") И Основание <> Неопределено Тогда
		
		СуществующийДок = НайтиПодчиненныйДокумент(Основание);
		
		Если ЗначениеЗаполнено(СуществующийДок) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='На основании документа %1 был введен %2'"),
			Основание,
			СуществующийДок);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗапретитьВвод=Истина;
			
		КонецЕсли;
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));

		Дата = Основание.Дата;
		
		ПараметрыДокументаОснования = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Основание);
		ВидДокументаОснования       = Основание.Метаданные().Имя;
		
		ДокументОснование = ПараметрыДокументаОснования.Ссылка;
		
		Если ВидДокументаОснования = "бит_ЗаявлениеОРегистрацииПоМестуПЖ" Тогда 
			
			ЛицевойСчет            = ДокументОснование.ЛицевойСчет;
			РегистрируемоеЛицо     = ДокументОснование.РегистрируемоеЛицо;
			ДатаРегистрации        = ДокументОснование.ДатаРегистрации;
			ДатаСнятияСРегистрации = ДокументОснование.ДатаСнятияСРегистрации;
			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Функция НайтиПодчиненныйДокумент(Основание) Экспорт
	
	Перем ПодчиненныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка КАК ПодчиненныйДокумент
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|ГДЕ
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование = &ДокументОснование
	|	И НЕ бит_СвидетельствоОРегистрацииПоМестуПребывания.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодчиненныйДокумент = Выборка.ПодчиненныйДокумент;
	КонецЕсли;
	
	Возврат ПодчиненныйДокумент;
	
КонецФункции

#КонецОбласти
